[
    {
        "heading": "Twitte clone",
        "descShort": "Building a fullstack web app, with the core features of Twitter",
        "descLong": "In this project we had to build a clone of Twitter to learn and gain an understanding of the basic elements of web development and databases. To build this clone I have used python with bottle, sqlite, css, js and html with developed templating from bottle. In addition to this, I have worked at pyhonanywhere, where the app is hosted. You are welcome to try signing up, posting, and playing aruond with the app. Just click the button to start exploring.",
        "img": "twitter_clone.png",
        "alt": "Twitte clone",
        "localHref": "twitter-clone",
        "prodHref": "https://webdevbymagnus.eu.pythonanywhere.com/",
        "skills": ["HTML", "Tailwind", "JS", "Python", "SQL"]
    },
    {
        "heading": "Hogwarts student list",
        "descShort": "Working with data cleaing, sorting, filtering and other functions",
        "descLong": "This project is about i was hired by Hogwarts School of Witchcraft and Wizardry, as a frontender, to help build a system so the administrator can handle the student lists. The assignment was to get some JSON data and cleaning it, make a sort and filter function, and assign students to different kind of role. To complete the projcet there was a lot of wireframe and acticy digram involde. If you want to see more of the progress, then click the button.",
        "img": "hogwarts_student_list.png",
        "alt": "Hogwarts student list",
        "localHref": "hogwarts-student-list",
        "prodHref": "https://magn902m.github.io/hacked_hogwarts/",
        "githubHref": "https://github.com/magn902m/hacked_hogwarts",
        "skills": ["HTML", "CSS", "JS", "Rest api"]
    },
    {
        "heading": "Webshop for payment terminals",
        "descShort": "The final project for my multimedia designer education",
        "descLong": "In this project, we had to solve a case, to reduce the number of phone calls, the possibility of adapting the products to the customers' visual style and to bring sustainability into the design and the product. To achieve this we used react, firebase, three.js and a bunch of other tools to build a prototype. If you want to see how we tried to solve the case, click the button.",
        "img": "webshop_payment_terminals.png",
        "alt": "Webshop",
        "localHref": "webshop-payment-terminals",
        "prodHref": "https://mmd-hovedopgaven.web.app/",
        "githubHref": "https://github.com/magn902m/mmd-hovedopgaven",
        "skills": ["React", "Scss", "Firebase", "Three.js", "Blender", "Figma"]
    }
]
